pbhagwat22/BMU_tester_board/src/safety/stm32f4xx_STLstartup.c
/**
  ******************************************************************************
  * @file stm32f4xx_STLstartup.c 
  * @author  MCD Application Team
  * @version  V1.0.0
  * @date  Apr-2013
  * @brief  This file contains all calls to the routines to be
  *                      executed at start.
  ******************************************************************************
  * @copyright
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  */ 


/* Includes ------------------------------------------------------------------*/
#include <safety/stm32f4xx_STLstartup.h>
#include <safety/stm32f4xx_STLparam.h>
#include <stm32f412vx.h>


/** @addtogroup STM32F4xxSelfTestLib_src
  * @{
  */ 


/* Private typedef -----------------------------------------------------------*/
  typedef enum
  {
    ERROR = 0U,
    SUCCESS = !ERROR
  } ErrorStatus;

/* Private define ------------------------------------------------------------*/
#define DO_NOW
#define SWITCH_ON_PLL
#define FLASH_MEMORY_START_TEST
#define CONTROL_FLOW_CHK
#define RAM_START_TEST
#define RAM_CRC_REF_CHCK
#define FREQ_TEST_START
#define FLASH_MEMORY_RUN_TEST
#define LAST_FLOW_CONTROL_START_TEST

/* Private macro -------------------------------------------------------------*/



/* Private variables ---------------------------------------------------------*/
uint32_t tmpCC4_last;	/* Frequency start test: keep last TIM5/Chn4 captured value */
uint32_t RomTest;       /* Used for Flash Runtime CRC check */
uint32_t RamTest;       /* Used for RAM Runtime check */
uint32_t tmpreg;
uint32_t lse_rdy_wait_prd;
extern unsigned int _sCLASS_B_RAM;
extern unsigned int _eCLASS_B_RAM;
extern unsigned int _sCLASS_B_RAM_REV;
extern unsigned int _eCLASS_B_RAM_REV;


  /* Temporary RAM buffer used during transparent RAM run-time test */
  uint32_t RunTimeRamBuf[RT_RAM_BLOCKSIZE] __attribute__((section(".RUN_TIME_RAM_BUF")));

  /* RAM pointer for RAM run-time tests */
   uint32_t *p_RunTimeRamChk        __attribute__((section(".RUN_TIME_RAM_PNT")));
   uint32_t *p_RunTimeRamChkInv     __attribute__((section(".RUN_TIME_RAM_PNT")));

   /* Counter for verifying correct program execution at start */
    uint32_t StartTestResult             __attribute__((section(".CLASS_B_RAM")));
    uint32_t StartTestResultInv          __attribute__((section(".CLASS_B_RAM_REV")));

  /* Counter for verifying correct program execution at start */
   uint32_t CtrlFlowCnt             __attribute__((section(".CLASS_B_RAM")));
   uint32_t CtrlFlowCntInv          __attribute__((section(".CLASS_B_RAM_REV")));

  /* Counter for verifying correct program execution in interrupt */
   uint32_t ISRCtrlFlowCnt          __attribute__((section(".CLASS_B_RAM")));
   uint32_t ISRCtrlFlowCntInv       __attribute__((section(".CLASS_B_RAM_REV")));

  /* LSI period measurement at TIM5 IRQHandler */
   uint32_t PeriodValue           __attribute__((section(".CLASS_B_RAM")));
   uint32_t PeriodValueInv        __attribute__((section(".CLASS_B_RAM_REV")));

  /* Indicates to the main routine a 100ms tick */
   volatile uint32_t LSEPeriodFlag      __attribute__((section(".CLASS_B_RAM")));
   volatile uint32_t LSEPeriodFlagInv   __attribute__((section(".CLASS_B_RAM_REV")));

  /* Stores the Control flow counter from one main loop to the other */
   uint32_t LastCtrlFlowCnt         __attribute__((section(".CLASS_B_RAM")));
   uint32_t LastCtrlFlowCntInv      __attribute__((section(".CLASS_B_RAM_REV")));

  /* Pointer to FLASH for crc16 run-time tests */
   uint8_t *p_RunCrc16Chk           __attribute__((section(".CLASS_B_RAM")));
   uint8_t *p_RunCrc16ChkInv        __attribute__((section(".CLASS_B_RAM_REV")));

  /* Pointer to FLASH for crc32 run-time tests */
   uint32_t *p_RunCrc32Chk          __attribute__((section(".CLASS_B_RAM")));
   uint32_t *p_RunCrc32ChkInv       __attribute__((section(".CLASS_B_RAM_REV")));

/* Reference 32-bit CRC for run-time tests */
   uint32_t RefCrc32                __attribute__((section(".CLASS_B_RAM")));
   uint32_t RefCrc32Inv             __attribute__((section(".CLASS_B_RAM_REV")));

/* Private function prototypes -----------------------------------------------*/
void STL_StartUp(void);
uint32_t CRC_CalcBlockCrc(const uint32_t *p, uint32_t len);
void FailSafePOR(StartTestResult_t test_result);
void TIM5_IRQHandler(void);
void CRC_Init(void);
void CRC_SetIDRegister(uint8_t IDValue);
ErrorStatus STL_FullRamMarchC(void);
uint32_t CRC_GetCRC(void);
RunRamResult_t STL_TranspMarchC(void);
ClassBTestStatus STL_crc32Run(void);
void safety_init(void);
/* Private functions ---------------------------------------------------------*/

/******************************************************************************/
/**
  * @brief  Contains the Fail Safe routine executed in case of
  *   failure detected during one of the POR self-test routines
  * @param  : None
  * @retval : None
  */
void FailSafePOR(StartTestResult_t test_result)
{
   /* early exit of startup test: record test result in RAM  */
   StartTestResult = (uint32_t)test_result;
   StartTestResultInv = ~StartTestResult;
   /* restart the application */
   GotoCompilerStartUp()   /* reset handler */

   /*  // Used during debug
   SysTick->CTRL= 0u;   // disable SystTick & its interrupt
  while(1)
  {  // Just stay here
  }
  */
}

/******************************************************************************/
/**
  * @brief  Contains the very first test routines executed right after
  *   the reset
  * @param  : None
  *   Flash interface initialized, Systick timer ON (2ms timebase)
  * @retval : None
  */
 void STL_StartUp(void)
{
	 uint32_t TimeOut;
	 ErrorStatus Result = ERROR;
	 StartTestResult_t test_result = START_TEST_PASS;

