pbhagwat22/BMU_tester_board/src/safety/stm32f4xx_STLstartup.c
	/* Select correct vector table address */
	#if BANK_0_SELECTED == 1		// IBL Bootloader
	  SCB->VTOR = 0x08020000;
	#endif
	#if BANK_1_SELECTED == 1
	  SCB->VTOR = 0x08040000;
	#endif
	/* Ensure address change is complete before advancing */
	__DSB();
	__ISB();

	#ifdef SWITCH_ON_PLL
  /*--------------------------------------------------------------------------*/
  /*-------------------- Switch ON PLL for high MHz operation ------------------*/
  /*--------------------------------------------------------------------------*/
  /* No Control flow check here (not safety critical) */
  /* Switch on the PLL to speed-up Flash and RAM tests */
   /* Config system clock */
   RCC->CFGR &= ~RCC_CFGR_HPRE; 		/* Clear HPRE[3:0] bits */
   RCC->CFGR |= RCC_CFGR_HPRE_DIV1; 	/* Set HPRE[3:0] bits according to RCC_SYSCLK value */
   RCC->CFGR &= ~RCC_CFGR_PPRE2; 		/* Clear PPRE2[2:0] bits */
   RCC->CFGR |= RCC_CFGR_PPRE2_DIV2;    /* Set PPRE2[2:0] bits according to RCC_HCLK value */
   RCC->CFGR &= ~RCC_CFGR_PPRE1; 		/*!< PRE2[2:0] bits (APB2 prescaler) */
   RCC->CFGR |= RCC_CFGR_PPRE1_DIV4;    /*!< HCLK divided by 4 */

   FLASH->ACR |= FLASH_ACR_PRFTEN; 		/* Enable Prefetch Buffer */
   /* RCC PLL Config */
   RCC->CR &= ~RCC_CR_PLLON;   			/* First Disable PLL */
   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLM;
   RCC->PLLCFGR |= RCC_PLLCFGR_PLLM_4;
   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLN;
   RCC->PLLCFGR |= 204u<<6;
   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLP;
   RCC->PLLCFGR |= 0x00<<16;
   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLSRC;
   RCC->PLLCFGR |= RCC_PLLCFGR_PLLSRC_HSI;
   RCC->PLLCFGR &= ~RCC_PLLCFGR_PLLQ;
   RCC->PLLCFGR |= 0x05<<24;
   RCC->CR |= RCC_CR_PLLON;   			/* Done, now Enable PLL */

   TimeOut = PLL_LOCK_TIMEOUT;

   do { TimeOut--; }
   while( ( (RCC->CR&RCC_CR_PLLRDY) == 0u)  && (TimeOut != 0u));   /* Wait till PLL is ready */
   if (TimeOut == 0u)   // debugger shows TimeOut is at 29776 here from 30000
   {
     Result = ERROR;     /* Clock switch failure */
   }
   else
   {
	   TimeOut = CLOCK_SWITCH_TIMEOUT;
	   FLASH->ACR &= ~0x0Fu;  					/* Clear */
	   FLASH->ACR |= FLASH_ACR_LATENCY_3WS;  	/* Increase flash latency before switch to fast clock */
	   RCC->CFGR  &= ~RCC_CFGR_SW ; 			/* Clear clock source bits */
	   RCC->CFGR  |= RCC_CFGR_SW_PLL ; 			/* Select PLL as system clock source */
	   /* Wait till PLL is used as system clock source */
	   do{ TimeOut--; }
	   while(((RCC->CFGR & RCC_CFGR_SWS)!= RCC_CFGR_SWS_PLL)  && (TimeOut != 0u));
	   if (TimeOut == 0u) // debugger shows TimeOut is at 999 here from 1000
	   {
	     Result = ERROR;     /* Clock switch failure */
	   }
	   else
	   {
	     Result = SUCCESS;
	   }
   }
  if (Result != SUCCESS)
  {
	  test_result = START_TEST_FAIL_PLL;
	  FailSafePOR(test_result);
  }
#endif // SWITCH_ON_PLL

/* Initialize control flow count */
  CtrlFlowCnt = 0x00000000;
  CtrlFlowCntInv = 0xFFFFFFFF;

#ifdef FLASH_MEMORY_START_TEST
  /*--------------------------------------------------------------------------*/
  /*-------FLASH--------- Invariable memory CRC check ------------------------*/
  /*--------------------------------------------------------------------------*/
  CtrlFlowCnt += CRC32_TEST_CALLER;
  /* Compute the 32-bit crc of the whole Flash by CRC unit */
  CRC_Init();     /* enable crc clock and reset the crc generator */
  CRC_CalcBlockCrc((uint32_t *)ROM_START, (uint32_t)(ROM_SIZEinWORDS-1));
  CtrlFlowCntInv -= CRC32_TEST_CALLER;
  CtrlFlowCnt += CRC_TEST_CALLER;
  /* Checks CRC calculated and Reference CRC are same*/
    if(CRC_GetCRC() != *(uint32_t *)REF_CRC32)
    {
      test_result = START_TEST_FAIL_FLASH;
      FailSafePOR(test_result);
    }
    else
    { /* Test OK */
      /* store the inverted least significant byte of the CRC in the peripheral */ 
      CRC_SetIDRegister(~((uint8_t)(CRC_GetCRC())));
      /* If else statement is not executed, it will be detected by control flow monitoring */
      CtrlFlowCntInv -= CRC_TEST_CALLER;
    }
#endif

#ifdef CONTROL_FLOW_CHK
  /*--------------------------------------------------------------------------*/
  /*   Verify Control flow before RAM init (which clears Ctrl flow counters)  */
  /*--------------------------------------------------------------------------*/
  if (((CtrlFlowCnt ^ CtrlFlowCntInv) != 0xFFFFFFFFuL)
      ||(CtrlFlowCnt != CHECKPOINT1 ))
  {
     test_result = START_TEST_FAIL_CHECKPOINT1;
     FailSafePOR(test_result);
  }
  else
  {
	  /* Control Flow Checkpoint 1 OK */
  }
#endif
  /*--------------------------------------------------------------------------*/
  /* --------RAM---------- Variable memory functional test -------------------*/
  /*--------------------------------------------------------------------------*/
#ifdef RAM_START_TEST
  /* WARNING: Stack is zero-initialized when exiting from this routine */
  if (STL_FullRamMarchC() != SUCCESS)
  {
    test_result = START_TEST_FAIL_RAM;
    FailSafePOR(test_result);
  }
    /* Full RAM Test OK */
    /* Both CtrlFlowCnt and CtrlFlowCntInv are zeroed then re-initialized inside
       the test routine to have inverse values */
#ifdef RAM_CRC_REF_CHCK
  /*--------------------------------------------------------------------------*/
  /*-- Store reference 32-bit CRC in RAM after RAM test (if not corrupted) ---*/
  /*--------------------------------------------------------------------------*/
  if ((CRC->IDR ^ ((uint8_t)CRC->DR)) == 0xFFu)   /* CRC_IDR: Independent data register , CRC_DR: Current CRC value */
  { /* Ref 32-bit CRC OK*/
    RefCrc32 = CRC->DR;
    RefCrc32Inv = ~RefCrc32;
  }
  else
  {
    test_result = START_TEST_FAIL_CRC_REG;
    FailSafePOR(test_result);  // Ref 32-bit CRC corrupted
  }
#endif //RAM_CRC_REF
#endif // RAM_START_TEST

#ifdef FREQ_TEST_START
  /*--------------------------------------------------------------------------*/
  /*----------------------- Clock Frequency Self Test ------------------------*/
  /*--------------------------------------------------------------------------*/
  CtrlFlowCnt += CLOCK_TEST_CALLER;
  ClockStatus CLK_FREQ_TEST_Result = TEST_ONGOING; /* In case of unexpected exit */
  CtrlFlowCnt += CLOCK_TEST_CALLEE;

  /* Start low speed Internal (LSI) oscillator */
  CtrlFlowCnt += LSI_INIT_CALLEE;

  RCC->CSR |= RCC_CSR_LSION;
  TimeOut = LSI_START_TIMEOUT;
  do{ TimeOut--; }
  while(((RCC->CSR  & RCC_CSR_LSIRDY) == 0u) && (TimeOut != 0u));

  if(TimeOut == 0)
  {
	  CLK_FREQ_TEST_Result = LSI_START_FAIL;
	  test_result = START_TEST_FAIL_FREQ_LSI;
  }
  else
  {   CtrlFlowCntInv -= LSI_INIT_CALLEE;
      TimeOut = DBP_REG_RST_TIMEOUT;
      CtrlFlowCnt += DBR_INIT_CALLEE;

	  /* Enable the Power clock*/
	  RCC->APB1ENR |= RCC_APB1ENR_PWREN;
	  tmpreg = (RCC->APB1ENR & RCC_APB1ENR_PWREN);

	  /* Enabled access to modify BDCR register*/
	  PWR->CR |= PWR_CR_DBP;

	  do{ TimeOut--; }
	  while(((PWR->CR & PWR_CR_DBP) == 0u) && (TimeOut != 0u));

	  if(TimeOut == 0)
	  {
		  CLK_FREQ_TEST_Result = DBR_RESET_FAIL;
		  test_result = START_TEST_FAIL_FREQ_DBR;
	  }
	  else
	  {   CtrlFlowCntInv -= DBR_INIT_CALLEE;
		  TimeOut = LSE_START_TIMEOUT;
		  CtrlFlowCnt += LSE_INIT_CALLEE;
		  /* Check if LSE is already On*/
		  if((RCC->BDCR & (RCC_BDCR_LSEON | RCC_BDCR_LSERDY )) != (RCC_BDCR_LSEON | RCC_BDCR_LSERDY) )
		  {
			  //Reset the D3 domain
			  RCC->BDCR |= RCC_BDCR_BDRST;
			  __DSB();
			  __ISB();
			  RCC->BDCR &= (~(RCC_BDCR_BDRST));
			  __DSB();
			  __ISB();

			  RCC->BDCR |= RCC_BDCR_LSEON;    			   /* Enable LSE */

			  /* Wait till LSE is ready */
			  do{ TimeOut--;
			      lse_rdy_wait_prd++;}
			  while(((RCC->BDCR & RCC_BDCR_LSERDY) == 0u) && (TimeOut != 0u));
		  }
		  if (TimeOut == 0u)   // debugger shows TimeOut at 1486045 down from 3125000
		  {
			  CLK_FREQ_TEST_Result = LSE_START_FAIL;
			  test_result = START_TEST_FAIL_FREQ_LSE;
		  }
		  else /* Start High-speed external oscillator (HSE) and Clock Security System (CSS) */
		  {
			  CtrlFlowCntInv -= LSE_INIT_CALLEE;
			  TimeOut = HSE_START_TIMEOUT;
			  CtrlFlowCnt += HSE_INIT_CALLEE;
			  RCC->CR |= RCC_CR_HSEON; 						/* Start-up the oscillator (HSE: High-speed External) */
			  /* Wait till HSE is ready */
			  do{ TimeOut--; }
			  while(((RCC->CR & RCC_CR_HSERDY) == 0u) && (TimeOut != 0u));
			  if (TimeOut == 0u)  // debugger shows TimeOut at 16893 down from 31250
			  {
				  CLK_FREQ_TEST_Result = HSE_START_FAIL;
				  test_result = START_TEST_FAIL_FREQ_HSE;
			  }
			  else
			  {
				  RCC->CR |= RCC_CR_CSSON;   				/* Enable the Clock Security System */
				  CtrlFlowCntInv -= HSE_INIT_CALLEE;
				  /*-------------- Reference Measurement ---------------------------------*/
				  TimeOut = CLOCK_SWITCH_TIMEOUT;
				  CtrlFlowCnt += CLOCK_SWITCH_CALLEE;
				  RCC->CFGR &= ~RCC_CFGR_SW;         		/* first clear */
				  RCC->CFGR |= RCC_CFGR_SW_HSE; 			/* Switch the main clock to HSE */
				  do {TimeOut--;}
				  while(((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE)  && (TimeOut != 0u));
				  if (TimeOut == 0u)  // debugger shows TimeOut at 999 down from 1000
				  {
					  CLK_FREQ_TEST_Result = HSI_HSE_SWITCH_FAIL;
					  test_result = START_TEST_FAIL_FREQ_SWITCH;
				  }
				  else
				  {   /* Configure TIM5 to measure LSI period */
					  CtrlFlowCntInv -= CLOCK_SWITCH_CALLEE;
					  /* Configure TIM5 to measure LSI period */
					  RCC->APB1ENR |= RCC_APB1ENR_TIM5EN;  	/* Enable TIM5 clock */
					  /* Connect internally the TIM5_CH4 Input Capture to the LSE clock output */
					  TIM5->OR &= ~TIM_OR_TI4_RMP;			/* Clear TI4_RMP */
					  TIM5->OR |= TIM_OR_TI4_RMP_1;			/* LSE connected to TIM5_CH4 input for calibration */
					  /* Configure TIM5 time base */
					  TIM5->PSC = 0x0000u;					/* Set the Prescaler value */
					  TIM5->EGR |= TIM_EGR_UG;  			/* Set or reset the UG Bit */
					  /* Configure TIM5 time base */
					  TIM5->CR1 &= ~TIM_CR1_DIR;   			/* up-counter */
					  TIM5->CR1 &= ~TIM_CR1_CMS; 			/* edge-aligned */
					  TIM5->CR1 &= ~TIM_CR1_CKD; 			/* no clock division */
					  /* Set the Auto-reload value */
					  TIM5->ARR = 0xFFFF;
					  /* Set the Auto reload value */
					  TIM5->PSC = 0x0000;
					  TIM5->EGR |= TIM_EGR_UG;  				/* PSCReloadMode_Immediate (TODO: THIS IS DONE TWICE)*/
					  /* Configure LSI oscillator into TIM5 channel 4 input  */
					  TIM5->CCER &= ~TIM_CCER_CC4E;   					/* clear CC4E: capture disabled*/
					  /* Select the Input and set the filter */
					  TIM5->CCMR2 &= ~TIM_CCMR2_CC4S;   				/* clear CC4S */
					  TIM5->CCMR2 |= TIM_CCMR2_CC4S_0;  				/* CC4 channel is configured as input, IC4 is mapped on TI4 */
					  TIM5->CCMR2 &= ~TIM_CCMR2_IC4F;  					/* clear IC4F: sets filter to "no filter") */
					  TIM5->CCER  &= ~(TIM_CCER_CC4P | TIM_CCER_CC4NP);  /*  00: non-inverted/rising edge */
					  TIM5->CCER  |= TIM_CCER_CC4E;  					/* Capture enabled */
					  TIM5->CCMR2 |= TIM_CCMR2_IC4PSC; 					/* Sets pre-scalar to DIV8 */
					  /* Enable TIM5 Interrupt channel */
					  NVIC_SetPriority(TIM5_IRQn,0u);    				/* set priority of IRQChannel*/
					  NVIC_EnableIRQ(TIM5_IRQn);   						/* Enable External Interrupt */
					  /* Enable TIM5 counter */
					  TIM5->CR1 |= TIM_CR1_CEN;
					  /* Reset the flags */
					  TIM5->SR = 0u;
					  LSEPeriodFlag = 0u;
					  /* Enable the CC4 Interrupt Request */
					  TIM5->DIER |= TIM_DIER_CC4IE; 				    /*!<Capture/Compare 4 interrupt enable   */
					  __enable_irq();
					  /* Wait for two subsequent LSE periods measured by TIM5 interrupt */
					  while (LSEPeriodFlag == 0u)
					  { }
					  LSEPeriodFlag = 0u;
					  while (LSEPeriodFlag == 0u)
					  { }
					  /*-------------------- HSE measurement check for 8MHz crystal ----------------*/
					  if (PeriodValue < HSE_LimitLow(8000000uL))
					  {
						  CLK_FREQ_TEST_Result = EXT_SOURCE_FAIL;		/* Sub-harmonics: HSE -10% below expected */
						  test_result = START_TEST_FAIL_FREQ_LOW;
					  }
					  else
					  {
						  if (PeriodValue > HSE_LimitHigh(8000000uL))
						  {
							  CLK_FREQ_TEST_Result = EXT_SOURCE_FAIL;		/* Harmonics: HSE +10% above expected */
							  test_result = START_TEST_FAIL_FREQ_HIGH;
						  }
						  else
						  {  /* HSE clock is OK */
							  CLK_FREQ_TEST_Result = FREQ_OK;         	/* Crystal or Resonator started correctly */
						  } /* No harmonics */
					  }  /* No sub-harmonics */
				  }    /* Clock switched correctly */
			  } /* HSE started correctly */
		  }   /* LSE started correctly */
	  }/*Disabled Backup power domain correctly*/
  }/*LSI started Correctly*/

  /* Switch back PLL to be fed by HSI internal clock */
  RCC->CFGR &= ~RCC_CFGR_SW;  /* clear System clock switch: results in RCC_CFGR_SW_HSI */
  CtrlFlowCntInv -= CLOCK_TEST_CALLEE;
  
  switch ( CLK_FREQ_TEST_Result )
  {
    case FREQ_OK:
      /* Clock frequency OK */
      break;

    case LSI_START_FAIL:
      /* LSI start-up failure */
      FailSafePOR(test_result);
      break;

    case DBR_RESET_FAIL:
      /* Disable Backup register reset failure */
      FailSafePOR(test_result);
      break;

    case LSE_START_FAIL:
      /* LSE start-up failure */
      FailSafePOR(test_result);
      break;

    case HSE_START_FAIL:
      /* HSE start-up failure */
      FailSafePOR(test_result);
      break;

