pbhagwat22/BMU_tester_board/src/safety/stm32f4xx_STLstartup.c
    case HSI_HSE_SWITCH_FAIL:
      /* Clock switch failure */
      FailSafePOR(test_result);
      break;

    case EXT_SOURCE_FAIL:
      /* Clock Source failure */
      FailSafePOR(test_result);
      break;

    case TEST_ONGOING:
    default:
      /* Abnormal Clock Test routine termination */
      test_result = START_TEST_FAIL_ABNORMAL_TERMINATION;
      FailSafePOR(test_result);
      break;
  }
  /* Either switch back to HSI or start PLL on HSE asap */
  CtrlFlowCntInv -= CLOCK_TEST_CALLER;
  #endif //FREQ_TEST

#ifdef LAST_FLOW_CONTROL_START_TEST
  /*--------------------------------------------------------------------------*/
  /* -----  Verify Control flow before Starting main program execution ------ */
  /*--------------------------------------------------------------------------*/
   
   if (((CtrlFlowCnt ^ CtrlFlowCntInv) != 0xFFFFFFFFuL)
      ||(CtrlFlowCnt != CHECKPOINT2 ))
   {
     /* Control Flow Error Checkpoint */
     test_result = START_TEST_FAIL_CHECKPOINT2;
     FailSafePOR(test_result);
   }
   /* Control Flow Checkpoint 2 OK */
#endif
   /* exiting startup test: record test result in RAM  */
   StartTestResult = test_result;
   StartTestResultInv = ~StartTestResult;
   /* restart the application */
   GotoCompilerStartUp()   /* reset handler */
}


/******************************************************************************/
/**
  * @brief  This function handles TIM5 global interrupt request.
  * @param  : None
  * @retval : None
  */
void TIM5_IRQHandler(void)
{
  uint32_t tmpCC4_last_cpy;

  if ((TIM5->SR & TIM_SR_CC4IF) != 0u )
  {
    tmpCC4_last_cpy = tmpCC4_last; 	/* store previous captured value */
    tmpCC4_last = TIM5->CCR4;       /* get currently captured value */
    /* The CC4IF flag is already cleared here be reading CCR4 register */

    /* overwrite results only in case the data is required */
    if (LSEPeriodFlag == 0u)
    {
      /* take correct measurement only */
      if ((TIM5->SR & TIM_SR_CC4OF) == 0u)
      {
        PeriodValue = tmpCC4_last - tmpCC4_last_cpy;    /* Compute period length */
        PeriodValueInv = ~PeriodValue;                  /* Record inverser */
        LSEPeriodFlag = 0xAAAAAAAAu;                    /* Set Flag tested */
        LSEPeriodFlagInv = 0x55555555u;                 /* Record inverser */
      }
      else
      {
        TIM5->SR &= (uint16_t)(~TIM_SR_CC4OF);          /* ignore computation in case of IC overflow */
      }
      /* ignore computation in case data is not required */
    }
  }
}

/**
  * @brief  This function verifies that RAM is functional,
  *   using the March C- algorithm.
  * @param  : None
  *   at the exception of CtrlFlowCntInv, set to 0xFFFFFFFF.
  * @retval : ErrorStatus = (ERROR, SUCCESS)
  */
ErrorStatus STL_FullRamMarchC(void)
{
  ErrorStatus Result = SUCCESS;
  uint32_t *p;       /* RAM pointer */

  uint32_t *ra= __builtin_return_address(0u); /* save return address (as it will be destroyed) */

  /* CtrlFlowCnt not used at function entry, since it will be cleared by the
     routine. CtrlFlowCntInv is written at the function exit */

   /* ---------------------------- STEP 1 ----------------------------------- */
   /* Write background with addresses increasing */
   for ( p = RAM_START; p <= RAM_END; ++p )
   {
      /* Scrambling not important when there's no consecutive verify and write */
      *p = BCKGRND;
   }

   /* ---------------------------- STEP 2 ----------------------------------- */
   /* Verify background and write inverted background with addresses increasing */
   for ( p = RAM_START; p <= RAM_END; ++p )
   {
      if ( *p != BCKGRND )
         {
            Result = ERROR;
         }
      *p = INV_BCKGRND;
   }

   /* ---------------------------- STEP 3 ----------------------------------- */
   /* Verify inverted background and write background with addresses increasing */
   for ( p = RAM_START; p <= RAM_END; ++p )
   {
      if ( *p != INV_BCKGRND )
         {
            Result = ERROR;
         }
      *p = BCKGRND;
   }

   /* ---------------------------- STEP 4 ----------------------------------- */
   /* Verify background and write inverted background with addresses decreasing */
   for ( p = RAM_END; p >= RAM_START; --p )
   {
      if ( *p != BCKGRND )
         {
            Result = ERROR;
         }
      *p = INV_BCKGRND;
   }

   /* ---------------------------- STEP 5 ----------------------------------- */
   /* Verify inverted background and write background with addresses decreasing */
   for ( p = RAM_END; p >= RAM_START; --p )
   {
      if ( *p != INV_BCKGRND )
         {
            Result = ERROR;
         }
      *p = BCKGRND;
   }

   /* ---------------------------- STEP 6 ----------------------------------- */
   /* Verify background with addresses increasing */
   for ( p = RAM_START; p <= RAM_END; p++ )
   {
      if (*p != BCKGRND)
      {
         Result = ERROR;    /* No need to take into account scrambling here */
      }
   }

  /* ==============================================================================*/

   CtrlFlowCntInv = 0xFFFFFFFFuL;

  /* Restore destroyed return address back into the stack (all the content is destroyed).
     Next line of code supposes the {r4-r10,pc} only was saved into stack for Keil
     so their restored values are not valid:
     => optiomizations at caller must be switched off as caller cannot relay on r4-r7 values!!! */
	*(uint32_t*)(__get_MSP() + 4u) = (uint32_t)ra;
	return (Result);
}

/**
  * @brief  Initializes CRC peripheral (enable its clock and reset CRC)
  * @param  : None
  * @retval : None
  */
void CRC_Init(void)
{
  CtrlFlowCnt += CRC32_INIT_CALLEE;  	/* This is for control flow monitoring */
  RCC->AHB1ENR |= RCC_AHB1ENR_CRCEN; 	/* Enable CRC module clock */
  CRC->CR = CRC_CR_RESET;  				/* Reset CRC generator */
  CtrlFlowCntInv -= CRC32_INIT_CALLEE;
}

/**
  * @brief  Returns the current CRC value.
  * @param  None
  * @retval 32-bit CRC
  */
uint32_t CRC_GetCRC(void)
{
  return (CRC->DR);
}

/**
  * @brief  Stores a 8-bit data in the Independent Data(ID) register.
  * @param  IDValue: 8-bit value to be stored in the ID register
  * @retval None
  */
void CRC_SetIDRegister(uint8_t IDValue)
{
  CRC->IDR = IDValue;
}

/**
  * @brief  Inializes the pointers to the Flash memory required during
  *   run-time
  * @param  : None
  * @retval : None
  */
void STL_FlashCrc32Init(void)
{
  p_RunCrc32Chk = (uint32_t*)ROM_START;
  p_RunCrc32ChkInv = ((uint32_t *)(uint32_t)(~(uint32_t)(ROM_START)));
  CRC_Init(); /* Reset the CRC generator */
}

/**
  * @brief  Computes the 16-bit CRC of a given part of the memory (words
  *   by words).
  * @param p: points to the first memory byte to be taken into account
  * @param len: length (in bytes) of the memory to be computed
  * @retval : 32-bit CRC using the 0x4C11DB7 polynomial
  */
uint32_t CRC_CalcBlockCrc(const uint32_t *p, uint32_t len)
{
	/* This is for control flow monitoring */
	CtrlFlowCnt += CRC32_TEST_CALLEE;
	do  /* Load memory content into the CRC generator data register */
	{
		CRC->DR = *p++;
	}
	while (len--);
	CtrlFlowCntInv -= CRC32_TEST_CALLEE;
	return (CRC->DR);
}

/**
  * @brief  Computes the crc in multiple steps and compare it with the
  *   ref value when the whole memory has been tested
  * @param  : None
  * @retval : ClassBTestStatus (TEST_RUNNING, CLASS_B_DATA_FAIL,
  *   TEST_FAILURE, TEST_OK)
  */
ClassBTestStatus STL_crc32Run(void)
{
    ClassBTestStatus Result = CTRL_FLW_ERROR; /* In case of abnormal function exit*/
    CtrlFlowCnt += CRC32_RUN_TEST_CALLEE;

	if ((((uint32_t)p_RunCrc32Chk) ^ ((uint32_t)p_RunCrc32ChkInv)) == 0xFFFFFFFFuL)  /* Check safety var integrity */
	{
		if (p_RunCrc32Chk < (uint32_t *)ROM_END)
		{
		  CRC_CalcBlockCrc((const uint32_t *)p_RunCrc32Chk, (uint32_t)(FLASH_BLOCK_WORDS-1));
		  p_RunCrc32Chk += FLASH_BLOCK_WORDS;     							/* Increment pointer to next block */
		  p_RunCrc32ChkInv = ((uint32_t *)~((uint32_t)p_RunCrc32Chk)); 		/* Update safety var */
		  Result = TEST_RUNNING;
		}
		else
		{
		  if ((RefCrc32 ^ RefCrc32Inv) == 0xFFFFFFFFuL) 	/* Check safety var integrity */
		  {
			  if(CRC_GetCRC() == (uint32_t)(RefCrc32)) 		/* Check new CRC to last CRC */
			  {
				  Result = TEST_OK;
			  }
			  else
			  {
				  Result = TEST_FAILURE;  						/* New CRC does not match last CRC */
			  }
			  STL_FlashCrc32Init(); 						/* Prepare next test (or redo it if this one failed) */
		  }
		  else /* Class B error on RefCrc32 */
		  {
			Result = CLASS_B_DATA_FAIL;
		  }
		}
	}
	else  /* Class B error p_RunCrc32Chk */
	{
		Result = CLASS_B_DATA_FAIL;
	}
	CtrlFlowCntInv -= CRC32_RUN_TEST_CALLEE;
	return (Result);
	}

RunFlashResult_t RunTime_Flash_CRC(void)
{
    /*----------------------------------------------------------------------*/
	 /*------------------ Invariable memory CRC check -----------------------*/
	 /*----------------------------------------------------------------------*/
	 CtrlFlowCnt += FLASH_TEST_CALLER;
	 RunFlashResult_t test_result;

	 RomTest = STL_crc32Run();  /* Requires the control flow check to be modified */
	 switch ( RomTest )
	 {
	   case TEST_RUNNING:
		   CtrlFlowCntInv -= FLASH_TEST_CALLER;
		   test_result = FLASH_RUN_TEST_ONGOING;
		 break;

	   case TEST_OK:
		 CtrlFlowCntInv -= FLASH_TEST_CALLER;
		 test_result = FLASH_RUN_TEST_PASS;
		 break;

	   case TEST_FAILURE:
		   test_result = FLASH_RUN_TEST_FAIL_CRC_CHECK;
		 break;
	   case CLASS_B_DATA_FAIL:
		   test_result = FLASH_RUN_TEST_FAIL_SAF_VAR;
		 break;
	   default:
		   test_result = FLASH_RUN_TEST_ABNORMAL_TERMINATION;
		 break;
	 }
	 return test_result;
}

/** @brief UL 1998 variable initialize.
 *    This function sets the initial values to all variables
 *	 	used for UL 1998 safety related checks.
 *
 * @param None.
 * @return None.
 */

void safety_init(void)
{
	/* Initialize CLASS_B_RAM */
	uint8_t *start_address;
	uint8_t *end_address;

