pbhagwat22/BMU_tester_board/src/safety/stm32f4xx_STLstartup.c
 	start_address 	= (uint8_t*)&_sCLASS_B_RAM;
 	end_address 	= (uint8_t*)&_eCLASS_B_RAM;
	while(start_address < end_address)
	{
		*start_address = 0x00;
		++start_address;
	}

 	start_address 	= (uint8_t*)&_sCLASS_B_RAM_REV;
 	end_address 	= (uint8_t*)&_eCLASS_B_RAM_REV;
	while(start_address < end_address)
	{
		*start_address = 0x00;
		++start_address;
	}
}

/**
  * @brief  Initializes the pointer to the RAM for the run-time
  *   transparent functional test.
  * @param  : None
  * @retval : None
  */
void STL_TranspMarchCInit(void)
{
  /* start address of the test has to be aligned to 16 address range */
   p_RunTimeRamChk = (uint32_t *)((uint32_t)CLASS_B_START & 0xFFFFFFFCuL);
   p_RunTimeRamChkInv = (uint32_t *)(uint32_t)(~(uint32_t)p_RunTimeRamChk);
}

/* ---------------------------------------------------------------------------*/
/**
  * @brief  This function verifies that 6 words of RAM are functional,
  *   overlapping) using the March C- algorithm.
  * @param  : None
  * @retval : ClassBTestStatus (TEST_RUNNING, CLASS_B_DATA_FAIL,
  *   TEST_FAILURE, TEST_OK)
  */
RunRamResult_t STL_TranspMarchC(void)
{
  ClassBTestStatus Result = TEST_RUNNING;
  RunRamResult_t test_result = RAM_RUN_TEST_ONGOING;
  uint32_t i;        /* Index for RAM physical addressing */

  ISRCtrlFlowCnt += RAM_MARCHC_ISR_CALLEE;
  /* Check Class B var integrity */
  if ((((uint32_t)p_RunTimeRamChk) ^ ((uint32_t)p_RunTimeRamChkInv)) == 0xFFFFFFFFuL)
  {
    //if (p_RunTimeRamChk >= CLASS_B_END)
	if (p_RunTimeRamChk >= RAM_END)   // full ram check
    {
      /*------------- Apply March C- to the RAM Buffer itself --------------- */
      p_RunTimeRamChk = &RunTimeRamBuf[0];
      p_RunTimeRamChkInv = (uint32_t*)(~(uint32_t)(&RunTimeRamBuf[0]));

      /*---------------------------- STEP 1 --------------------------------- */
      /* Write background with addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        *(p_RunTimeRamChk + i) = BCKGRND;
      }

      /*---------------------------- STEP 2 --------------------------------- */
      /* Verify background and write inverted background addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        if ( *(p_RunTimeRamChk + i) != BCKGRND )
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i) = INV_BCKGRND;
      }

      /*---------------------------- STEP 3 --------------------------------- */
      /* Verify inverted background and write background addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        if ( *(p_RunTimeRamChk + i) != INV_BCKGRND )
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i) = BCKGRND;
      }

      /*---------------------------- STEP 4 --------------------------------- */
      /* Verify background and write inverted background addresses decreasing */
      for( i = RT_RAM_BLOCKSIZE; i > 0u ; --i )
      {
        if ( *(p_RunTimeRamChk + i - 1u) != BCKGRND)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 1u) = INV_BCKGRND;
      }

      /*---------------------------- STEP 5 --------------------------------- */
      /* Verify inverted background and write background addresses decreasing */
      for( i = RT_RAM_BLOCKSIZE; i > 0u ; --i )
      {
        if ( *(p_RunTimeRamChk + i - 1u) != INV_BCKGRND)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 1u) = BCKGRND;
      }

      /*---------------------------- STEP 6 --------------------------------- */
      /* Verify background with addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        if ( *(p_RunTimeRamChk + i) != BCKGRND )
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
      }

      /* Check again Class B variable integrity */
      if ((((uint32_t)p_RunTimeRamChk) ^ ((uint32_t)p_RunTimeRamChkInv)) == 0xFFFFFFFFuL)
      {
        /* Prepare next Tranparent RAM test from the beginning of Class A area */
        p_RunTimeRamChk = CLASS_B_START;
        p_RunTimeRamChkInv = ((uint32_t *)~((uint32_t)CLASS_B_START));

        if (Result == TEST_RUNNING)
        {
          Result = TEST_OK; /* Means all selected variable memory was scanned */
          test_result = RAM_RUN_TEST_PASS;
        }
        else  /* Buffer is not functional */
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
      }
      else  /* Class B error on p_RunTimeRamChk */
      {
        Result = CLASS_B_DATA_FAIL;
        test_result = RAM_RUN_TEST_FAIL_SAF_VAR;
      }

    } /* ------------------ End of Buffer Self-check ------------------------ */
    else
    { /* ------------------ Regular memory Self-check ----------------------- */
      /*---------------------------- STEP 1 --------------------------------- */
      /* Save the content of the 6 words to be tested and start MarchC -
         Write background with addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        RunTimeRamBuf[i] = *(p_RunTimeRamChk + i - 1u);
        *(p_RunTimeRamChk + i - 1u) = BCKGRND;
      }

      /*---------------------------- STEP 2 --------------------------------- */
      /* Verify background and write inverted background addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        if ( *(p_RunTimeRamChk + i - 1u) != BCKGRND )
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 1u) = INV_BCKGRND;
      }

      /*---------------------------- STEP 3 --------------------------------- */
      /* Verify inverted background and write background addresses increasing */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        if ( *(p_RunTimeRamChk + i - 1u) != INV_BCKGRND)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 1u) = BCKGRND;
      }

      /*---------------------------- STEP 4 --------------------------------- */
      /* Verify background and write inverted background addresses decreasing */
      for( i = RT_RAM_BLOCKSIZE; i > 0u; --i )
      {
        if ( *(p_RunTimeRamChk + i - 2u) != BCKGRND)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 2u) = INV_BCKGRND;
      }

      /*---------------------------- STEP 5 --------------------------------- */
      /* Verify inverted background and write background addresses decreasing */
      for( i = RT_RAM_BLOCKSIZE; i > 0u; --i )
      {
        if ( *(p_RunTimeRamChk + i - 2u) != INV_BCKGRND)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 2u) = BCKGRND;
      }

