pbhagwat22/BMU_tester_board/src/safety/stm32f4xx_STLstartup.c
      /*---------------------------- STEP 6 --------------------------------- */
      /* Verify background with addresses increasing */
      /* and restore the content of the 6 tested words */
      for( i = 0u; i < RT_RAM_BLOCKSIZE; ++i )
      {
        if ( *(p_RunTimeRamChk + i - 1u) != BCKGRND)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;
        }
        *(p_RunTimeRamChk + i - 1u) = RunTimeRamBuf[i];
      }

      /* Check again Class B variable integrity */
      if ((((uint32_t)p_RunTimeRamChk) ^ ((uint32_t)p_RunTimeRamChkInv)) == 0xFFFFFFFFuL)
      {
        /* Prepare next Row Tranparent RAM test */
        p_RunTimeRamChk += RT_RAM_BLOCKSIZE - (2u * RT_RAM_BLOCK_OVERLAP);
        p_RunTimeRamChkInv = (uint32_t *)(uint32_t)(~(uint32_t)p_RunTimeRamChk);

        if (Result != TEST_RUNNING)
        {
          Result = TEST_FAILURE; test_result = RAM_RUN_TEST_FAIL;  /* Word line under test was not functional */
        }
        else
        {
          /* Do nothing: keep Result as TEST_RUNNING */
        }
      }
      else  /* Class B error on p_RunTimeRamChk when exiting the function*/
      {
        Result = CLASS_B_DATA_FAIL;
        test_result = RAM_RUN_TEST_FAIL_SAF_VAR;
      }
    } /* --------------- End of Regular memory Self-check --------------------- */
  }
  else  /* Class B error on p_RunTimeRamChk when entering the function*/
  {
    Result = CLASS_B_DATA_FAIL;
    test_result = RAM_RUN_TEST_FAIL_SAF_VAR;
  }

  ISRCtrlFlowCntInv -= RAM_MARCHC_ISR_CALLEE;

  return (test_result);

}

RunRamResult_t RunTimeRAMTest(void)
{
	RunRamResult_t RamTest;
	RamTest = STL_TranspMarchC();
	return RamTest;
}

uint32_t get_startup_test_result(void)
{
	return(StartTestResult);
}

uint32_t get_startup_test_result_inv(void)
{
	return(StartTestResultInv);
}

uint32_t get_clk_period(void)
{
	return(PeriodValue);
}

uint32_t get_lse_wait_period(void)
{
	return(lse_rdy_wait_prd);
}

/**
  * @}
  */

/******************* (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

